app/views/books/index.html.erb

                    <%= link_to book_favorites_path(book), class: "text-danger", method: :delete do %>
                      <i class="fas fa-heart"></i> <%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

                    <%= link_to book_favorites_path(book), class: "text-primary", method: :post do %>
                      <i class="fas fa-heart"></i> <%= book.favorites.count %>
---
SELECT COUNT({:class=>"text-primary"}) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

              <td>
                <p>コメント数: <%= book.book_comments.count %></p>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]