app/controllers/book_comments_controller.rb

  def destroy
    BookComment.find_by(id: params[:id], book_id: params[:book_id]).destroy
---
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 1], ["book_id", 1], ["LIMIT", 1]]